In [18]:
import pandas as pd
import numpy as np
import os
import warnings
import pickle
import requests
import json

warnings.filterwarnings("ignore")

In [2]:
current_directory = os.getcwd()
parent_directory = os.path.abspath(os.path.join(current_directory, os.pardir))
dc = os.path.join(parent_directory, "data")

df_test = pd.read_csv(os.path.join(dc, "test.csv"), sep=",")

In [3]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [7]:
df = df_test[["Pclass", "Sex", "Age", "SibSp", "Parch", "Fare", "Embarked"]].copy()
df = df.dropna()

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 331 entries, 0 to 415
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    331 non-null    int64
 1   Sex       331 non-null    object
 2   Age       331 non-null    float64
 3   SibSp     331 non-null    int64
 4   Parch     331 non-null    int64
 5   Fare      331 non-null    float64
 6   Embarked  331 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 20.7+ KB

In [9]:
df.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [36]:
payload = dict()
payload["features"] = df.to_dict(orient="records")

In [41]:
payload["features"][0]

{'Pclass': 3,
 'Sex': 'male',
 'Age': 34.5,
 'SibSp': 0,
 'Parch': 0,
 'Fare': 7.8292,
 'Embarked': 'Q'}

In [42]:
requests.post("http://127.0.0.1:8000/predict", json=payload)

In [46]:
requests.post(
    "http://127.0.0.1:8000/predict", json={"features": [payload["features"][0]]}
)